app/views/status_task_users/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <tr>
        <td><%= status_task_user.user.first_name %> <%= status_task_user.user.last_name %></td>