app/views/tasks/show.html.erb

            <div class="task-card assigned">
              <div class="task-description"><%= User.find(applicant.user_id).first_name %> <%= User.find(applicant.user_id).last_name %></div>
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "tasks_users" ON "users"."id" = "tasks_users"."user_id" WHERE "tasks_users"."task_id" = ?  [["task_id", 16]]