app/controllers/roles_controller.rb

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "worker"], ["created_at", "2018-04-24 11:13:20.145531"], ["updated_at", "2018-04-24 11:13:20.145531"]]