app/controllers/sessions_controller.rb

  def create
    reset_session # prevent session fixation
    par = login_params
    user = User.find_by(email: par[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "chris@gmail.com"], ["LIMIT", 1]]