app/controllers/status_task_users_controller.rb

  def index
    @status_task_users = StatusTaskUser.all
---
SELECT "status_task_users".* FROM "status_task_users"

  def create
    @status_task_user = StatusTaskUser.new(status_task_user_params)

    respond_to do |format|
      if @status_task_user.save
---
INSERT INTO "status_task_users" ("user_id", "task_id", "status_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["task_id", 20], ["status_id", 1], ["created_at", "2018-04-25 13:51:40.211511"], ["updated_at", "2018-04-25 13:51:40.211511"]]

  def update
    respond_to do |format|
      if @status_task_user.update(status_task_user_params)
---
UPDATE "status_task_users" SET "status_id" = ?, "updated_at" = ? WHERE "status_task_users"."id" = ?  [["status_id", 2], ["updated_at", "2018-04-25 14:40:07.677573"], ["id", 2]]

  def destroy
    @status_task_user.destroy
---
DELETE FROM "status_task_users" WHERE "status_task_users"."id" = ?  [["id", 1]]

    def set_status_task_user
      @status_task_user = StatusTaskUser.find(params[:id])
---
SELECT  "status_task_users".* FROM "status_task_users" WHERE "status_task_users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]