app/controllers/statuses_controller.rb

  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "pending"], ["created_at", "2018-04-25 13:33:16.148120"], ["updated_at", "2018-04-25 13:33:16.148120"]]

  def set_status
    @status = Status.find(params[:id])
---
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]