app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (date >= '2018-04-26')
SELECT "tasks"."id" FROM "tasks"
SELECT  "status_task_users".* FROM "status_task_users" ORDER BY "status_task_users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "status_task_users"."task_id" FROM "status_task_users" WHERE (user_id = 1 and status_id = 1)
SELECT "tasks".* FROM "tasks" WHERE (date >= '2018-04-26') AND "tasks"."id" IN (1, 2, 3, 4) ORDER BY "tasks"."date" ASC
---
  def index
    #helper
      all_future_tasks = Task.where("date >= ?", Date.today)

      all_tasks_id = Task.all.pluck(:id)

      all_statustaskuser_entries = StatusTaskUser.all

      all_assigned_tasks_id  =  all_statustaskuser_entries.where("status_id = 3").pluck(:task_id)

      all_pending_tasks_id = all_statustaskuser_entries.where("status_id = 1").pluck(:task_id)

      tasks_not_assigned_id = all_tasks_id - all_assigned_tasks_id  || all_assigned_tasks_id  - all_tasks_id

      tasks_without_application_and_not_pending_id = tasks_not_assigned_id - all_pending_tasks_id || all_pending_tasks_id - tasks_not_assigned_id

      pending_usertasks_id = all_statustaskuser_entries.where("user_id = ? and status_id = 1", current_user.id).pluck(:task_id)

      open_usertasks_id = tasks_not_assigned_id - pending_usertasks_id || pending_usertasks_id - tasks_not_assigned_id


    #helper-end

    #für user

    @assigned_usertasks = all_future_tasks & Task.order(:date).find(all_statustaskuser_entries.where("user_id = ? and status_id = 3", current_user.id).pluck(:task_id))

    @pending_usertasks = all_future_tasks & Task.order(:date).find(pending_usertasks_id)

SELECT "status_task_users".* FROM "status_task_users" WHERE "status_task_users"."task_id" = ?  [["task_id", 2]]
SELECT "status_task_users"."user_id" FROM "status_task_users" WHERE "status_task_users"."task_id" = ? AND "status_task_users"."status_id" = ?  [["task_id", 10], ["status_id", 3]]
---
  def show
    @task_applicants = StatusTaskUser.where(task_id: @task.id)
    @assigned_applicant = User.find(StatusTaskUser.where(task_id: @task.id, status_id: 3).pluck(:user_id))

INSERT INTO "status_task_users" ("user_id", "task_id", "status_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["task_id", 20], ["status_id", 1], ["created_at", "2018-04-25 14:41:46.562320"], ["updated_at", "2018-04-25 14:41:46.562320"]]
---
  def add_user
    stu = StatusTaskUser.new({:user_id => current_user.id, :task_id => @task.id, :status_id => 1})
    respond_to do |format|
      if stu.save

DELETE FROM "status_task_users" WHERE "status_task_users"."user_id" = ? AND "status_task_users"."task_id" = ?  [["user_id", 1], ["task_id", 1]]
---
  def remove_user
    StatusTaskUser.where(user_id: current_user.id, task_id: @task.id).delete_all

SELECT  "status_task_users".* FROM "status_task_users" WHERE "status_task_users"."user_id" = ? AND "status_task_users"."task_id" = ? ORDER BY "status_task_users"."id" ASC LIMIT ?  [["user_id", 1], ["task_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "status_task_users" SET "status_id" = ?, "updated_at" = ? WHERE "status_task_users"."id" = ?  [["status_id", 3], ["updated_at", "2018-04-26 09:58:32.431517"], ["id", 1]]
---
  def assign_user

    task_applicants = StatusTaskUser.where(task_id: @task.id)

    task_applicants.each do |a|
      a.status_id = 2
      a.save
    end

    assigned_candidate = StatusTaskUser.where(user_id: params[:applicant_id], task_id: @task.id).first
    assigned_candidate.status_id = 3

    if assigned_candidate.save

INSERT INTO "tasks" ("description", "date", "time", "place", "assigned", "no_of_people", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(task_params)
    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Babysitter in Mülln gesucht"], ["updated_at", "2018-04-24 11:19:32.097654"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)