app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
    @assigned_usertasks = current_user.tasks.where(:assigned => true)
---
SELECT  "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" INNER JOIN "tasks_users" ON "tasks"."id" = "tasks_users"."task_id" WHERE "tasks_users"."user_id" = ? AND "tasks"."assigned" = ?  [["user_id", 1], ["assigned", "f"]]