app/controllers/users_controller.rb

  def new
    @user = User.new
    @roles = Role.all
---
SELECT "roles".* FROM "roles"

  def edit
    @roles = Role.all
---
SELECT "roles".* FROM "roles"

  def create
    @roles = Role.all
    random_password = Randomstring.generate(20)
    p = user_params
    p[:password] = random_password
    p[:password_confirmation] = random_password
    @user = User.new(p)
    @skip_password_validation = true

    respond_to do |format|
      if @user.save
---
SELECT "roles".* FROM "roles"
INSERT INTO "users" ("role_id", "first_name", "last_name", "email", "telephone", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @roles = Role.all
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "hehe"], ["last_name", "kek"], ["updated_at", "2018-04-24 13:05:49.027175"], ["id", 1]]

  def destroy
    task_ids = StatusTaskUser.where(user_id: @user.id).where(status_id: 3).pluck(:task_id)
    relevant = Task.where(id: task_ids).where("date >= ?", Date.today)
    if(!relevant.empty?())
      respond_to do |format|
        format.html { redirect_to users_url, alert: 'Benutzer kann nicht gelöscht werden, wenn ihm noch Aufgaben zugewiesen sind!' }
        format.json { head :no_content }
      end
    else
      @user.destroy
---
SELECT "status_task_users"."task_id" FROM "status_task_users" WHERE "status_task_users"."user_id" = ? AND "status_task_users"."status_id" = ?  [["user_id", 3], ["status_id", 3]]
SELECT  1 AS one FROM "tasks" WHERE 1=0 AND (date >= '2018-04-26') LIMIT ?  [["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]